from array import array
import math
import numpy as np
import random

# 1. Написати програму для обробки одновимірного масиву (бібліотека array)



# masiv = array('i', [])
#
# n = int(input("Введіть кількість елементів: "))
#
# for i in range(n):
#     masiv.append(int(math.pow(2, i)))
#
# print("Масив: ", masiv)



# 2. Написати програму для обробки двовимірного масиву (бібліотека NumPy)

# n = int(input("Введіть кількість елементів: "))
# m = int(input("Введіть кількість елементів: "))
#
# masiv = np.zeros((n , m))
#
#
# for i in range(n):
#     for j in range(m):
#         masiv[i][j] = random.randint(1, 100000)
#
#
# print("Двовимірний масив, заповнений випадковими числами:")
# print(masiv)


# !!Варіант 16!!

# 1. Масив заповнено 7 випадковими числами в діапазоні від 1 до 20.
# Програма повинна дописати в масив після середнього елемента N випадкових
# чисел у діапазоні від 31 до 40.


# masiv = np.array([random.randint(1, 20) for i in range(7)])
#
# print("Початковий масив:", masiv)
#
# mid = len(masiv) // 2
#
# n = int(input("Введіть кількість нових елементів: "))
#
# NewMid = ([random.randint(31, 40) for i in range(n)])
#
# masiv = np.insert(masiv, mid + 1, NewMid)
#
# print("Змінений масив:",masiv)

# 2. Існують три арифметичні прогресії: перша прогресія має вигляд 1, 3,
# 5…; друга прогресія має вигляд 5, 9,13…; третя прогресія має вигляд 21, 22,
# 23… . Користувач задає кількість членів прогресії N. Програма повинна
# звписати ці прогресії у двовимірний масив А, який складається з 3 рядків і N
# стовпчиків, а в одновимірний масив В – записати суми стовпчиків масиву А.



# n = int(input("Введіть кількість членів прогресії: "))
#
# a = np.zeros((3, n), dtype=int)
#
# for i in range(n):
#     a[0][i] = 1 + 2 * i
#     a[1][i] = 5 + 4 * i
#     a[2][i] = 21 + i
#
# print("Масив A (3 рядки, N стовпців):")
# print(a)
#
# b = np.sum(a, axis=0)
#
# print("Масив b (суми стовпців масиву a):")
# print(b)
