
# 1. Написати програму, яка використовує кортежі (приклад 8.1).

# simvol = tuple("афторсульфонилоксиалканперфторкарбонова кислота")
# n = simvol.count('а')
# print("Кількість 'а' =", n)

# 2. Написати програму, яка використовує множини (приклад 8.2).

# q = {'a', 'd', 'c', 'e'}
# w = {'a', 'b', 'c'}
# r = {'b', 'c', 'd', 'e'}
#
# n = q & w
#
# for elem in n:
#     if elem not in r:
#         print(elem)


# 3. Написати програму, яка використовує словники (приклад 8.3).

# workers = dict()
# workers['Мельник'] = '30'
# workers['Шевченко'] = '25'
# workers['Коваленко'] = '28'
# workers['Бондаренко'] = '34'
# workers['Бойко'] = '22'
# workers['Ткаченко'] = '26'
# workers['Кравченко'] = '33'
# workers['Ковальчук'] = '27'
#
#
# for key in workers:
#     print(f"{key}: {workers[key]} років")
#
# print("Вік робітників:", list(workers.values()))


# !!Варіант 16!!
# 1. Кортеж містить 7 елементів (рядки, цілі і дійсні числа). Програма
# повинна записати рядки з кортежу в список.



# cortez = ("Hello", 42, 3.14, "World", 7, "Python", 2.71)
# listt = [item for item in cortez if isinstance(item, str)]
#
#
# print("Список рядків з кортежу:", listt)



# 2. Користувач вводить рядок символів. Програма повинна: 1) обчислити
# кількість повторів символів; 2) вивести на екран унікальні символи; 3) вивести
# на екран символи які зустрічаються у тексті лише один раз.


# userINT = input("Введіть рядок символів: ")
#
# count = {}
# for char in userINT:
#     if char in count:
#         count[char] += 1
#     else:
#         count[char] = 1
#
# chars = set(userINT)
#
# single_chars = [char for char, count in count.items() if count == 1]
#
# print("Кількість повторів кожного символу:", count)
# print("Унікальні символи:", chars)
# print("Символи, що зустрічаються лише один раз:", single_chars)




# 3. Створити словник-довідник з даними про фірми і кількість робітників у
# них. Даний словник повинен доповнюватися записами з клавіатури. Далі
# програма повинна створити другий словник, ключі для якого взяти з першого
# словника, а у користувача записати рік заснування фірми. Створений другий
# словник повинен бути виведений на екран.


# firms = {
#     "Apple": 150000,
#     "Microsoft": 180000,
#     "Google": 140000
# }
#
# while True:
#     firmName = input("Введіть назву фірми (або 'стоп' для завершення): ")
#     if firmName.lower() == 'стоп':
#         break
#     num_employees = int(input(f"Введіть кількість робітників у фірмі {firmName}: "))
#     firms[firmName] = num_employees
#
# foundYears = {}
# for firm in firms:
#     year = int(input(f"Введіть рік заснування фірми {firm}: "))
#     foundYears[firm] = year
#
# print("Словник з роками заснування фірм:", foundYears)
